# Сделать функцию которая на вход принимает строку. Анализирует её
# исключительно методом .isdigit() без доп.библиотек и переводит строку в число.
# Функция умеет распознавать отрицательные числа и десятичные дроби, а так же
# распознаёт десятичные дроби как с точкой, так и с запятой.
# *Дополнительно: правильно распознаётся десятичная дробь без первого значащего нуля
# Примеры:
# -6,7    →   Вы ввели отрицательное дробное число: -6.7
# 5       →   Вы ввели положительное целое число: 5
# 5.4r    →   Вы ввели не корректное число: 5.4r
# -.777   →   Вы ввели отрицательное дробное число: -0.777
