# Создать список из двух элементов.
# Создать кортеж из двух элементов.
# Создать словарь с одной парой. Ключ - кортеж, значение - список
# Создать словарь с одной парой. Ключ - список, значение – кортеж


a = [1, 2]
b = ('a', 'b')
c = {1: 'ss', 2: a}

d_1 = {b: a}
print(d_1)

d_2 = {b: c}
print(d_2)

# d_2 = {a: b}
# print(d_2)
